# merging dataframes


!pip install pandas

In [1]:
!pip install pandas

Requirement already satisfied: pandas in e:\anaconda\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in e:\anaconda\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in e:\anaconda\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in e:\anaconda\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in e:\anaconda\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
#dataframe 1
df1=pd.DataFrame({ "city":["new york","chicago","orlando"],
                 "temperature":[21,13,35],
                 })
df1

       city  temperature
0  new york           21
1   chicago           13
2   orlando           35

In [4]:
#dataframe 2
df2=pd.DataFrame({ "city":["chicago","new york","orlando","france"],
                 "humidity":[65,66,78,61],
                 })
df2

       city  humidity
0   chicago        65
1  new york        66
2   orlando        78
3    france        61

In [5]:
#merging both dataframes(sort of intersection)
df3=pd.merge(df1,df2,on='city')
df3

       city  temperature  humidity
0  new york           21        66
1   chicago           13        65
2   orlando           35        78

In [6]:
#merging both dataframes(sort of union)(bydefault merge is inner)
df4=pd.merge(df1,df2,on='city',how="outer")
df4

       city  temperature  humidity
0  new york         21.0        66
1   chicago         13.0        65
2   orlando         35.0        78
3    france          NaN        61

In [7]:
#merging both dataframes(sort of union)
df5=pd.merge(df1,df2,on='city',how="left")
df5

       city  temperature  humidity
0  new york           21        66
1   chicago           13        65
2   orlando           35        78

In [8]:
#merging both dataframes(sort of union)
df6=pd.merge(df1,df2,on='city',how="right")
df6

       city  temperature  humidity
0   chicago         13.0        65
1  new york         21.0        66
2   orlando         35.0        78
3    france          NaN        61

In [9]:
#to check which side is nan
df4=pd.merge(df1,df2,on='city',how="outer",indicator=True)
df4

       city  temperature  humidity      _merge
0  new york         21.0        66        both
1   chicago         13.0        65        both
2   orlando         35.0        78        both
3    france          NaN        61  right_only

In [15]:
#suffixes
df7=pd.DataFrame({
    "city":["new york","chicago","dis","san"],
    "temperature":[21,14,35,43],
    "humidity":[65,68,71,82]
})
df7

       city  temperature  humidity
0  new york           21        65
1   chicago           14        68
2       dis           35        71
3       san           43        82

In [13]:
df8=pd.DataFrame({
    "city":["chicago","new york","san"],
    "temperature":[21,14,35],
    "humidity":[65,68,35]
})
df8

       city  temperature  humidity
0   chicago           21        65
1  new york           14        68
2       san           35        35

In [18]:
df9=pd.merge(df7,df8,on="city",suffixes=('_left','_right'))
df9

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,21,65,14,68
1,chicago,14,68,21,65
2,san,43,82,35,35